blog-backend/app/controllers/signin_controller.rb

  def create
    user = User.find_by!(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "root@root.com"], ["LIMIT", 1]]