blog-backend/app/controllers/api/v2/blogs_controller.rb

      def create
        @blog = current_user.blogs.build(blog_params)

        if @blog.save
---
INSERT INTO "blogs" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "idk blog"], ["body", "id idk"], ["user_id", 4], ["created_at", "2021-03-09 10:49:12.782089"], ["updated_at", "2021-03-09 10:49:12.782089"]]

      def update
        @blog = Blog.find(params[:id])

        if @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "hemloedit"], ["body", "hemloedit"], ["updated_at", "2021-03-09 13:35:18.439788"], ["id", 9]]

        def set_blog
          @blog = current_user.blogs.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]