blog-backend/app/controllers/api/v2/comments_controller.rb

      def index
        @blog = Blog.find(params[:blog_id])
        @comments = @blog.comments.all
        array=[]
        @comments.all.each do |comment|
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 1]]

      def show
        @blog = Blog.find(params[:blog_id])

        @comments = @blog.comments.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def create
        @comment = current_user.comments.create(comment_params)
---
INSERT INTO "comments" ("body", "blog_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "first comment"], ["blog_id", 1], ["user_id", 4], ["created_at", "2021-03-10 07:01:55.488209"], ["updated_at", "2021-03-10 07:01:55.488209"]]