app/controllers/api/v1/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 2]]
---
      def index
        @blogs = current_user.blogs.all

INSERT INTO "blogs" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "first blog"], ["body", "thisisfirst blog"], ["user_id", 1], ["created_at", "2021-03-05 06:02:58.177013"], ["updated_at", "2021-03-05 06:02:58.177013"]]
---
      def create
        @blog = current_user.blogs.build(blog_params)

        if @blog.save